**Groupby()**

The groupby()
 function is a method that belongs to the DataFrame class. It works by splitting data into groups based on specified criteria, applying a function to each group independently, then combining the results into a data structure. When applied to a dataframe, the function returns a groupby object. This groupby object serves as the foundation for different data manipulation operations, including:

* Aggregation: Computing summary statistics for each group

* Transformation: Applying functions to each group and returning modified data

* Filtration: Selecting specific groups based on certain conditions

* Iteration: Iterating over groups or values

In [8]:
import pandas as pd
clothes = pd.DataFrame({'type': ['pants', 'shirt', 'shirt', 'pants', 'shirt', 'pants'],
                       'color': ['red', 'blue', 'green', 'blue', 'green', 'red'],
                       'price_usd': [20, 35, 50, 40, 100, 75],
                       'mass_g': [125, 440, 680, 200, 395, 485]
                       })


clothes

    type  color  price_usd  mass_g
0  pants    red         20     125
1  shirt   blue         35     440
2  shirt  green         50     680
3  pants   blue         40     200
4  shirt  green        100     395
5  pants    red         75     485

In [3]:
grouped = clothes.groupby('type')
print(grouped)
print(type(grouped))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D0C2B882F0>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

However, an aggregation function can be applied to the groupby object:

* aggregation is calculation that we make

In [25]:
clothes.groupby(['type','color']).mean()

             price_usd  mass_g
type  color
pants blue        40.0   200.0
      red         47.5   305.0
shirt blue        35.0   440.0
      green       75.0   537.5

In the preceding example, groupby() was called directly on the clothes dataframe. The data was grouped first by type, then by color. This resulted in four groupsâ€”the number of different existing combinations of values for type and color. Then, the min() function was applied to the result to filter each group by its minimum value.

To simply return the number of observations there are in each group, use the size() method. This will result in a Series object with the relevant information:

In [26]:
clothes.groupby(['type', 'color']).size()

type   color
pants  blue     1
       red      2
shirt  blue     1
       green    2
dtype: int64

**agg()**

Built-in aggregation functions
The previous examples demonstrated the mean(), min(), and size() aggregation functions applied to groupby objects. There are many available built-in aggregation functions. Some of the more commonly used include:

* count(): The number of non-null values in each group

* sum(): The sum of values in each group

 * mean(): The mean of values in each group

* median(): The median of values in each group

* min(): The minimum value in each group

* max(): The maximum value in each group

* std(): The standard deviation of values in each group

* var(): The variance of values in each group*

In [27]:
clothes[['price_usd', 'mass_g']].agg(['sum', 'mean'])

       price_usd  mass_g
sum   320.000000  2325.0
mean   53.333333   387.5

In [28]:
clothes

    type  color  price_usd  mass_g
0  pants    red         20     125
1  shirt   blue         35     440
2  shirt  green         50     680
3  pants   blue         40     200
4  shirt  green        100     395
5  pants    red         75     485

* Columns are not subset from the dataframe before applying the agg() function. This is unnecessary because the columns are specified within the agg() function itself.

* The argument to the agg() function is a dictionary whose keys are columns and whose values are the functions to be applied to those columns. If multiple functions are applied to a column, they are entered as a list. Again, each built-in function is entered as a string without parentheses.

* The resulting dataframe contains NaN values where a given function was not designated to be used.

The following example applies the sum() and mean() functions across axis 1. In other words, instead of applying the functions down each column, theyâ€™re applied over each row.

In [30]:
clothes[['price_usd', 'mass_g']].agg(['sum', 'mean'], axis=1)   # Dia buat calculation based on row

     sum   mean
0  145.0   72.5
1  475.0  237.5
2  730.0  365.0
3  240.0  120.0
4  495.0  247.5
5  560.0  280.0

In the following example, the items in clothes are grouped by color, then each of those groups has the mean() and max() functions applied to them at the price_usd and mass_g columns.

In [31]:
clothes.groupby('color').agg({'price_usd': ['mean', 'max'],
                             'mass_g': ['mean', 'max']})

      price_usd      mass_g
           mean  max   mean  max
color
blue       37.5   40  320.0  440
green      75.0  100  537.5  680
red        47.5   75  305.0  485

*MultiIndex*  ðŸ›º

In [32]:
grouped = clothes.groupby(['color', 'type']).agg(['mean', 'min'])
grouped

            price_usd     mass_g
                 mean min   mean  min
color type
blue  pants      40.0  40  200.0  200
      shirt      35.0  35  440.0  440
green shirt      75.0  50  537.5  395
red   pants      47.5  20  305.0  125

In [34]:
grouped.index

MultiIndex([( 'blue', 'pants'),
            ( 'blue', 'shirt'),
            ('green', 'shirt'),
            (  'red', 'pants')],
           names=['color', 'type'])

In [35]:
grouped.columns

MultiIndex([('price_usd', 'mean'),
            ('price_usd',  'min'),
            (   'mass_g', 'mean'),
            (   'mass_g',  'min')],
           )

In [37]:
grouped

            price_usd     mass_g
                 mean min   mean  min
color type
blue  pants      40.0  40  200.0  200
      shirt      35.0  35  440.0  440
green shirt      75.0  50  537.5  395
red   pants      47.5  20  305.0  125

In [36]:
grouped.loc[:, 'price_usd']

             mean  min
color type
blue  pants  40.0   40
      shirt  35.0   35
green shirt  75.0   50
red   pants  47.5   20

In [38]:
grouped.loc[:, ('price_usd', 'min')]

color  type
blue   pants    40
       shirt    35
green  shirt    50
red    pants    20
Name: (price_usd, min), dtype: int64

In [39]:
grouped.loc[('green', 'shirt'), :]

price_usd  mean     75.0
           min      50.0
mass_g     mean    537.5
           min     395.0
Name: (green, shirt), dtype: float64

In [40]:
grouped.loc[('blue', 'shirt'), ('mass_g', 'mean')]

np.float64(440.0)

f you want to remove the row MultiIndex from a groupby result, include as_index=False as a parameter to your groupby() statement

In [41]:
clothes.groupby(['color', 'type'], as_index=False).mean()

   color   type  price_usd  mass_g
0   blue  pants       40.0   200.0
1   blue  shirt       35.0   440.0
2  green  shirt       75.0   537.5
3    red  pants       47.5   305.0